In [1]:
import pandas as pd
data = [1,2,3,4,5]
df = pd.DataFrame(data)
print(df)

   0
0  1
1  2
2  3
3  4
4  5

In [2]:
data = {'Name': ['Tom', 'Jack', 'Steve'], 'Age': [29, 34, 23]}
df = pd.DataFrame(data)
df

    Name  Age
0    Tom   29
1   Jack   34
2  Steve   23

In [4]:
df = pd.DataFrame(data, index= ['rank1', 'rank2', 'rank3', ])
df

        Name  Age
rank1    Tom   29
rank2   Jack   34
rank3  Steve   23

In [18]:
import random
data = {}

lst = []
for i in range(10):
    lst.append('Name_' + str(i))
data['Name'] = lst    

lst = []
for i in range(10):
    lst.append(random.randint(12, 32))
data['Age'] = lst

df = pd.DataFrame(data)
df

     Name  Age
0  Name_0   25
1  Name_1   21
2  Name_2   15
3  Name_3   27
4  Name_4   14
5  Name_5   14
6  Name_6   15
7  Name_7   27
8  Name_8   25
9  Name_9   16

In [19]:
import pandas as pd
import random
data = {}

lst = []
for i in range(10):
    lst.append('Name_' + str(i))
data['Name'] = lst    


lst = []
for i in range(10):
    lst.append('Family_' + str(i))
data['Family'] = lst    

lst = []
for i in range(10):
    lst.append(random.randint(12, 32))
data['Age'] = lst

df = pd.DataFrame(data)
df

     Name    Family  Age
0  Name_0  Family_0   14
1  Name_1  Family_1   23
2  Name_2  Family_2   29
3  Name_3  Family_3   29
4  Name_4  Family_4   12
5  Name_5  Family_5   28
6  Name_6  Family_6   16
7  Name_7  Family_7   12
8  Name_8  Family_8   29
9  Name_9  Family_9   12

In [24]:
#create csv file from our data frame
df.to_csv('F:/.../.../.../.../11.06.00/dataframe.csv')

In [25]:
df.sample(3)

     Name    Family  Age
5  Name_5  Family_5   28
4  Name_4  Family_4   12
2  Name_2  Family_2   29

In [26]:
#showing first 5 rows
df.head()

     Name    Family  Age
0  Name_0  Family_0   14
1  Name_1  Family_1   23
2  Name_2  Family_2   29
3  Name_3  Family_3   29
4  Name_4  Family_4   12

In [28]:
#showing the lasst 5 rows
df.tail()

     Name    Family  Age
5  Name_5  Family_5   28
6  Name_6  Family_6   16
7  Name_7  Family_7   12
8  Name_8  Family_8   29
9  Name_9  Family_9   12

In [72]:
class person:
#     count = 0
    lst = [17,2,37,4,5]
    
    def __init__(self):
        self.name = 'unknown'
        self.age = 0
#         self.count2 = 5
        
    def sorting(self):
        lst = self.lst
        self.lst = sorted(lst)   
        
    def displayInfo(self):
        #even self can access to outer attributes(count)
        print(self.name, self.age, self.lst,)

In [62]:
#creating an object
ob = person()

In [63]:
ob.displayInfo()

unknown 0 [17, 2, 37, 4, 5]

In [64]:
#we can not call displayInfo function
displayInfo()

NameError: name 'displayInfo' is not defined

In [70]:
ob.sorting()

In [71]:
ob.displayInfo()

unknown 0 [2, 4, 5, 17, 37]

In [73]:
#creating random decimal numbers between 0 and 1 up to 2 decimal places 
import random
round(random.uniform(0,1), 2)

0.09

## Example of OOP

In [45]:
class Customer:
    def __init__(self, cname, cid, cjob):
        self.cname = cname
        self.cid = cid
        self.cjob = cjob
        
    def getCName(self):
        return self.cname
        
    def getCid(self):
        return self.cid
    
    def getCJob(self):
        return self.cjob
    
    def setCJob(self, new_job):
        self.cjob = new_job

In [46]:
c1 = Customer('shaya', 1234,'Student')
c2 = Customer('aida', 7777,'Teacher')

In [47]:
class Account:
    def __init__(self, customer, account_number, balance):
        self.customer = customer
        self.account_number = account_number
        self.balance = balance
        
    def deposit(self, amount):
        self.balanbce = self.balance + amount
        
    def withdraw(self, amount):
        if amount <= self.balance:
            self.balance = self.balance - amount
        else:
            print('you do not have enough funds')
            
    def getCustomer(self):
        return self.customer
    
    def getAccountNumber(self):
        return self.account_number
    
    def getBalance(self):
        return self.balance

In [48]:
c1_account = Account(c1, 100, 120000)
c2_account = Account(c2, 101, 5000)

In [49]:
class BankAccounts:
    def __init__(self, accounts):
        self.alist = accounts
        
    def addAccount(self, account):
        for i in self.alist:
            if account is i :
                print('This account has already been added')
                return
        self.alist.append(account)  
        
    def removeAccount(self, account):
        counter = 0
        for i in self.alist:
            if account is i:
                self.alist.pop(counter)
                return 
            counter = counter + 1
        print('This account does not exist!')
    
    def printAllCBalances(self):
        for i in self.alist:
            print(i.getCustomer().getCName(), i.getBalance())

In [50]:
# c1 = Customer(c1, 1234,'Student')
# c1.getCJob()

In [51]:
# c1_account = Account(c1, 100, 120000)
# c1_account.getAccountNumber()

In [52]:
# c2 = Customer('aida', 7777,'Teacher')
# c2_account = Account(c2, 101, 5000)
# c2_account.getCustomer()

In [58]:
# c3_account = ('Melanee', 34, 1000000)
bas = BankAccounts([])
bas.addAccount(c1_account)
bas.addAccount(c2_account)

c1_account.deposit(2000)

# c1_account = Account(c1, 100, 120000)
# c2_account = Account('jack', 101, 5000)



# bas.addAccount(c2_account)
# bas.addAccount(c3_account)


c1_account.withdraw(3000)
# c2_account.withdraw(1500)

c2_account.withdraw(1000)

bas.printAllCBalances()

# bas.removeAccount(c2_account)
# bas.printAllCBalances()

shaya 114000
aida 770

In [ ]:
bas.removeAccount(c2_account)

In [ ]:
bas.printAllCBalances()

## Multi Argument

In [16]:
def show(name):
    print(f'the name is : {name}')

In [18]:
show('ali')

the name is : ali

In [62]:
def show(name, *args, **kwargs):
    print(f'the name is: {name},', args, kwargs)

## Another example of OOP

In [64]:
show('ali', 'amir', 5, 7, s=23, m=97)

class Student:
    def __init__(self, sn, sf, sid, sy):
        self.sname = sn
        self.sfamily = sf
        self.sid = sid
        self.syear = sy
        
        
    def getSName(self):
        return self.sname
    
    def getSFamily(self):
        return self.sfamily
    
    def getSid(self):
        return self.sid
    
    def get_all(self):
        return self.sname, self.sid, self.syear, self.sfamily
    
    def getSYear(self):
        return self.syear
    
#     def setSYear(self, sy):
#         if type(sy) is str and (sy.lower()=='freshman' or sy.lower()=='sophomore' or sy.lower()=='junior' or sy.lower()=='senior'):
#      #graduated can not change
#                       self.syear = sy
#         else:
#             print('You have input an invalid value! The only allowable input are freshman , sophomore, junior, and senior')

class Course:
    def __init__(self, cn, cid, sl):
        self.cname = cn
        self.cid = cid
        self.slist = sl
        
    def getCName (self):
        return self.cname
    
    def getCid(self):
        return self.cid
    
    def prinALllStudents(self,):
        for i in self.slist:
            print(i.getSName(), i.getSFamily(), i.getSid(), i.getSYear())
            #methods from other classes are accessable in other calsses, unless that method is been privated.
        print()    
        print('For course:', self.cname ) 

    def addStudent(self, st):
        if type(st) is Student:
            for i in self.slist:
                if i is st:
                    print("This student is already added to the course!")
                    return 
            self.slist.append(st)
        else:
            print("Sorry, this is not a student!")

c1 = Course('Algorithm', 15110, [] )

s1 = Student('zahra', 'Aghaee', 100, 'junior')
s2= Student('zohre', 'Molaee', 101, 'freshman')
s3= Student('Melanee', 'Rahmani', 102, 'senior')
s4= Student('sahar', 'Rezaee', 103, 'freshman')

c1.addStudent(s1)
c1.addStudent(s2)
c1.addStudent(s3)
c1.addStudent(s4)

c1.prinALllStudents()

the name is: ali, ('amir', 5, 7) {'s': 23, 'm': 97}

In [144]:
c2 = Course('Python Programming', 15000, [] )
s1 = Student('yalda','Rezaee', 104, 'junior')
s2 = Student('tahere', 'Alemi', 105, 'freshman')
s3 = Student('masi', 'ghasemi' , 106, 'senior')
s4 = Student('reza', 'Rafiepour', 107, 'freshman')
s5 = Student('ali', 'shahini', 108, 'junior')
s6 = Student('sepide', 'gholikhani', 109, 'freshman')
s7 = Student('goli','yousefzadeh' ,110, 'senior')
c2.addStudent(s1)
c2.addStudent(s2)
c2.addStudent(s3)
c2.addStudent(s4)
c2.addStudent(s5)
c2.addStudent(s6)
c2.addStudent(s7)
c2.prinALllStudents()

yalda Rezaee 104 junior
tahere Alemi 105 freshman
masi ghasemi 106 senior
reza Rafiepour 107 freshman
ali shahini 108 junior
sepide gholikhani 109 freshman
goli yousefzadeh 110 senior

For course: Python Programming

## set time for input

In [7]:
import time
import datetime
def input_fun():
    i = 0
    lst = []
    while True:
        i+=1
        s = datetime.datetime.now()
        in_ = input('please enter input:')
        
        time.sleep(5)
        
        e = datetime.datetime.now()
        dif = (e-s).total_seconds()
        lst.append(in_)
        if dif > 5:
            return lst

input_fun()

please enter input:8

['8']

## Fibonacci function

In [74]:
def fib(n):
    a, b = 0,1
    for i in range(n):
        b, a = a+b, b
    print(b)

In [75]:
fib(8)

34

In [ ]:
import sys
print('This is the name of programm:', sys.argv[0])
print('Number of elements including the name of the programm:', len(sys.argv))
print('Number of elements including the name of the programm:', len(sys.argv)-1)
print('Argument list:', str(sys.argv))

## Caesar() function